<template>
    <div class="box">
        <h3>白天流程</h3>
        <p>1、法官宣布昨夜出局情况，出局玩家遗言，如果出现</br>
            多死的情况，将按照玩家号码从小到大的顺序公布夜晚</br>
            出局情况，与出局顺序无关!若没有玩家出局则法官宣布“昨晚平安夜”</p>
        <p>2、遗言结束后，若有警长，则警长安排是从自己的上</br>
            家开始逆序发言还是从自己的下家开始顺序发言;若无</br>
            警长则看昨天是否是平安夜，如果是平安夜，则从随机</br>
            玩家开始随机顺序发言;若不是平安夜，则从出局玩家</br>
            的上家开始逆序发言</p>
        <p>3、发言结束后，开始放逐投票。投票时，警长视为1.5</br>
            票，得票最高的玩家出局并遗言</p>
        <p>4、如果有两位及以上的玩家平票，则pk发言，发言完</br>
            毕后进入pk投票，若pk阶段再次平票，则当天平安日，</br>
            即白天无人出局</p>
        <p>5、期间狼人可以自爆立即终止白天流程，狼人30s遗言</br>
            后，直接进入天黑</p>
        <p>6、 重复夜晚流程和天亮流程直到游戏结束。</p>
    </div>
  </template>
  
  <script>
  export default {
    name: 'dayrule',
    data () {
      return {}
    }
  }
  </script>
  
  <style scoped>
  .box{
      font-size: 15rem;
  }
  p,h3{
    padding:4rem;
      margin: 2rem;
  }
  </style>
  